In [2]:
import pandas as pd
df=pd.read_csv("samples.csv")
df

   s.no     name  age gender   dept  salary
0     1    saina   20      f    ece   20000
1     2     john   25      m    cse   42000
2     3     peng   23      f    cse   45000
3     4    steve   25      m    eee   23450
4     5    jwala   19      f    ece   43000
5     6    naina   22      f   mech   21000
6     7      ved   45      m  metal   35000
7     8  shresta   30      f   mech   23000

In [7]:
print(df.groupby(["gender"]))
print(df)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001A74D838F40>
   s.no     name  age gender   dept  salary
0     1    saina   20      f    ece   20000
1     2     john   25      m    cse   42000
2     3     peng   23      f    cse   45000
3     4    steve   25      m    eee   23450
4     5    jwala   19      f    ece   43000
5     6    naina   22      f   mech   21000
6     7      ved   45      m  metal   35000
7     8  shresta   30      f   mech   23000

In [12]:
a=df.groupby(["gender","dept"])
print(a.groups)

{('f', 'cse'): [2], ('f', 'ece'): [0, 4], ('f', 'mech'): [5, 7], ('m', 'cse'): [1], ('m', 'eee'): [3], ('m', 'metal'): [6]}

In [13]:
print(df.groupby(["dept"]).max())

       s.no     name  age gender  salary
dept
cse       3     peng   25      m   45000
ece       5    saina   20      f   43000
eee       4    steve   25      m   23450
mech      8  shresta   30      f   23000
metal     7      ved   45      m   35000

In [16]:
print(df.groupby(["gender"]).max())

        s.no     name  age   dept  salary
gender
f          8  shresta   30   mech   45000
m          7      ved   45  metal   42000

In [18]:
print(df.groupby(["dept"]).groups)

{'cse': [1, 2], 'ece': [0, 4], 'eee': [3], 'mech': [5, 7], 'metal': [6]}

In [19]:
print(df.groupby(["gender"]).groups)

{'f': [0, 2, 4, 5, 7], 'm': [1, 3, 6]}

In [21]:
g=df.groupby(["gender"])
print(g.get_group("m"))

   s.no   name  age gender   dept  salary
1     2   john   25      m    cse   42000
3     4  steve   25      m    eee   23450
6     7    ved   45      m  metal   35000

In [22]:
df["gender"].value_counts

<bound method IndexOpsMixin.value_counts of 0    f
1    m
2    f
3    m
4    f
5    f
6    m
7    f
Name: gender, dtype: object>

In [30]:
a=df.groupby(["dept","gender"])
print(a.groups)

{('cse', 'f'): [2], ('cse', 'm'): [1], ('ece', 'f'): [0, 4], ('eee', 'm'): [3], ('mech', 'f'): [5, 7], ('metal', 'm'): [6]}